In [1]:
import pandas as pd

# Series

In [2]:
odd = [1, 3, 5, 7,9]
odd

[1, 3, 5, 7, 9]

In [4]:
pd_odd = pd.Series(odd)
pd_odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [5]:
pd_odd.mean()

5.0

## 리스트보다 시리즈를 쓰는 것이 판다스를 활용하는데 더 좋다

## DataFrame

In [6]:
numbers = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

numbers = pd.DataFrame(numbers)
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [7]:
numbers[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [8]:
type(numbers)

pandas.core.frame.DataFrame

In [9]:
type(numbers[0])

pandas.core.series.Series

In [11]:
type(numbers.loc[0])

pandas.core.series.Series

In [12]:
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
numbers[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [15]:
numbers.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

### Data Type

In [17]:
# int == interger == 정수형
type(1)

int

In [18]:
type(1.0)

float

In [19]:
type("Hello world!")

str

In [24]:
odd = [1, 3, 5, 7, 9]

odd = pd.Series(odd)

odd.dtypes

dtype('int64')

In [26]:
odd = [1, 3, 5, 7, 9, 'hello!']

odd = pd.Series(odd)

# O == Object == str == string
odd.dtypes

dtype('O')

### NaN (Not a Number)

In [32]:
import numpy as np

odd = [1, np.nan, 5, 7,9]

odd = pd.Series(odd)

odd.dtypes

odd

0    1.0
1    NaN
2    5.0
3    7.0
4    9.0
dtype: float64

In [33]:
odd.mean()

5.5

In [36]:
import numpy as np

odd = [1, -1, 5, 7,9]

odd = pd.Series(odd)

odd.mean()

# 데이터를 분석하는 입장에서는 -1 처럼 정의하는 건 문제가 있을 수 있다.

4.2

In [37]:
np.nan == np.nan

False

In [38]:
value = np.nan

pd.isnull(value)

True

In [39]:
pd.isnull(np.nan)

True

In [40]:
pd.notnull(value)

False

## DataFrame

### 생성하기

In [41]:
order = [
    ['2017-01-01', 500, 'confirmed'],
    ['2017-01-03', 700, 'confirmed'],
    ['2017-01-10', 200, 'canceled']    
]

columns = ['date', 'price', 'state']

order = pd.DataFrame(order, columns = columns)

order

         date  price     amount
0  2017-01-01    500  confirmed
1  2017-01-01    700  confirmed
2  2017-01-01    200   canceled

In [48]:
#방식2

oder = {
    'date' : ['2017-01-01', '2017-01-03','2017-01-10'],
    'price' : [500, 700, 200],
    'state' : ['confiremd', 'confirmed', 'canceled']
}

order = pd.DataFrame(order)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

In [50]:
#방식3

order = [
    {'date' : '2017-01-01', 'price': 500, 'state':'confirmed'},
    {'date' : '2017-01-03', 'price': 700, 'state':'confirmed'},
    {'date' : '2017-01-10', 'price': 200, 'state':'canceled'}
]

order = pd.DataFrame(order)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

### pandas에서는 보통 방식2를 선호하지만, 실제로 데이터를 수집하는 과정에서는 방식3을 쓰는 경우가 많아서 방식3을 많이 활용할 여지가 있다.

In [54]:
order_url = "https://bit.ly/dsa-01-order"

order = pd.read_csv(order_url)

order.columns

Index(['id', 'user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [55]:
order

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed
5   6        5           7  2017-01-09    600    Busan   canceled
6   7        2           5  2017-01-10    200      NaN   canceled

In [57]:
order_url = "https://bit.ly/dsa-01-order"

order = pd.read_csv(order_url, index_col = "id")

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [58]:
order_url = "https://bit.ly/dsa-01-order"

order = pd.read_csv(order_url)
order = order.set_index("id")

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [59]:
order.index

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64', name='id')

In [62]:
order.columns

Index(['user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [61]:
order.values

array([[3, 9, '2017-01-01', 500, 'Seoul', 'confirmed'],
       [1, 7, '2017-01-03', 700, 'Seoul', 'confirmed'],
       [3, 8, '2017-01-03', 900, 'Daejeon', 'confirmed'],
       [4, 2, '2017-01-07', 500, nan, 'canceled'],
       [7, 3, '2017-01-09', 700, 'Incheon', 'confirmed'],
       [5, 7, '2017-01-09', 600, 'Busan', 'canceled'],
       [2, 5, '2017-01-10', 200, nan, 'canceled']], dtype=object)

In [63]:
type(order.index)

pandas.core.indexes.numeric.Int64Index

In [70]:
order.columns = ['user_id', 'product_id', 'date', 'amount', 'address', 'result']

order

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [71]:
order.head(1)

    user_id  product_id        date  amount address     result
id
1         3           9  2017-01-01     500   Seoul  confirmed

In [69]:
order.head(5)

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed

In [72]:
order.tail()

    user_id  product_id        date  amount  address     result
id
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [73]:
order.tail(1)

    user_id  product_id        date  amount address    result
id
7         2           5  2017-01-10     200     NaN  canceled

In [74]:
order["date"].head()

id
1    2017-01-01
2    2017-01-03
3    2017-01-03
4    2017-01-07
5    2017-01-09
Name: date, dtype: object

# 기본연산

In [75]:
order

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [77]:
order["amount"].mean()

585.7142857142857

In [78]:
order["amount"].min()

200

In [79]:
order["amount"].max()

900

In [81]:
order["amount"].describe()

count      7.000000
mean     585.714286
std      219.306266
min      200.000000
25%      500.000000
50%      600.000000
75%      700.000000
max      900.000000
Name: amount, dtype: float64

In [82]:
order["result"]

id
1    confirmed
2    confirmed
3    confirmed
4     canceled
5    confirmed
6     canceled
7     canceled
Name: result, dtype: object

In [84]:
order["result"].describe()

count             7
unique            2
top       confirmed
freq              4
Name: result, dtype: object

In [85]:
order["result"].unique()

array(['confirmed', 'canceled'], dtype=object)

In [88]:
order["result"].value_counts()

confirmed    4
canceled     3
Name: result, dtype: int64

In [89]:
order["result"].value_counts(normalize = True)

confirmed    0.571429
canceled     0.428571
Name: result, dtype: float64

In [96]:
order["result_revised"] = order["result"].replace("confirmed", "confirm").replace("canceled", "cancel")

In [108]:
del order["result_revise"]

order

    user_id  product_id        date  amount  address     result result_revised
id
1         3           9  2017-01-01     500    Seoul  confirmed        confirm
2         1           7  2017-01-03     700    Seoul  confirmed        confirm
3         3           8  2017-01-03     900  Daejeon  confirmed        confirm
4         4           2  2017-01-07     500      NaN   canceled         cancel
5         7           3  2017-01-09     700  Incheon  confirmed        confirm
6         5           7  2017-01-09     600    Busan   canceled         cancel
7         2           5  2017-01-10     200      NaN   canceled         cancel

In [112]:
order["date"] = pd.to_datetime(order["date"])

order["date"].dt.year
order["date"].dt.month
order["date"].dt.hour

id
1    0
2    0
3    0
4    0
5    0
6    0
7    0
Name: date, dtype: int64

### 행렬 검색하기

In [114]:
order[["date", "amount"]]

         date  amount
id
1  2017-01-01     500
2  2017-01-03     700
3  2017-01-03     900
4  2017-01-07     500
5  2017-01-09     700
6  2017-01-09     600
7  2017-01-10     200

In [117]:
type(order[["date", "amount"]])

pandas.core.frame.DataFrame

In [118]:
type(order)

pandas.core.frame.DataFrame

In [119]:
type(order["date"])

pandas.core.series.Series

## 1-12까지 학습